Revit 2027 API
ConstraintToRebarEdgeProperties(TargetRebarEdge) Constructor
 Constructs a new instance of ConstraintToRebarEdgeProperties.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConstraintToRebarEdgeProperties(
	TargetRebarEdge targetRebarEdge
)
Public Sub New (
	targetRebarEdge As TargetRebarEdge
)
public:
ConstraintToRebarEdgeProperties(
	TargetRebarEdge^ targetRebarEdge
)
new :
        targetRebarEdge : TargetRebarEdge -> ConstraintToRebarEdgeProperties
Parameters
targetRebarEdge TargetRebarEdge
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConstraintToRebarEdgeProperties Class
ConstraintToRebarEdgeProperties Overload
Autodesk.Revit.DB.Structure Namespace